
public class B11_Var2 {
	
	public static void main(String[] args) {
		
	/*
	 * 		1. 변수는 선언된 {}를 벗어나면 사라짐 ex) if문 안에서 선언한 변수는 if문 밖에서 사용불가
	 * 		2. 선언된 {}를 벗어나 사라진 변수는 다른 {}안에서 새롭게 선언가능함(먼저 사라져야함)
	 *		3. for문 내부에서 선언한 변수는 for문의 {}에서 선언한 것으로 간주한다, 즉 for이 끝나면 사라짐 
	 * 		4. 특정 {}밖에서 선언한 변수는 그 {}가 포함하고 있는 내부의 {}가 끝나도 계속 사용가능
	 * 
	 * 		1. 들여쓰기 Ctrl+Shift+F
	 * 		2. 새로운 {}가 열리면 한번 들여쓰기 한다 \t
	 * 		3. }뒤에 뭔가 하지말고 걍 줄바꿈\n else if는 붙여쓰는게 원칙
	 * 		4. 스페이스바로 줄맞추는거 자제 1번으로 하면 저절로 맞춰짐
	 * 		5. 빨간줄 있으면 자동들여쓰기가 작동하지않음 먼저 해결 ㄱㄱ
	 * 		6. for문 같은거에서 연산자는 띄어쓰는게 원칙임 c+s+f가 시키는대로 
	 * 		
	 * 		 ** 자세한 내용은 자바 코드 컨벤션 검색

	 */
	}

}
